[ 
{
  "name": "LatentVision",
  "slug": "latentvision",
  "image": "assets/latentvision.png",
  "tech": [
    "Python", "PyTorch","NumPy", "Scikit-Learn", "UMAP-Learn", "Matplotlib","Plotly","Streamlit","PCA/UMAP","Vit","Representation Learning","Dimensionality Reduction", "Model Interpretability"
  ],
  "github": "https://github.com/liyuanmontreal/LatentVision",
  "description": {
    "en": "LatentVision is a tool for projecting and visualizing visual Transformer latent spaces, supporting PCA/UMAP dimensionality reduction, clustering analysis, 3D/interactive point cloud visualization, and representational geometry analysis.",
    "zh": "LatentVision — 一个用于投影与可视化视觉 Transformer 嵌入空间的工具，支持 PCA/UMAP 降维、聚类分析、3D/交互式点云可视化与表征几何分析。",
    "fr": "LatentVision est un outil de projection et de visualisation des espaces latents des transformateurs visuels, prenant en charge la réduction de dimension PCA/UMAP, l’analyse de clustering, la visualisation de nuages de points 3D/interactifs et l’analyse de la géométrie représentationnelle."
  }
},
 {
  "name": "HybridQuantumClassicalNN",
  "slug": "qnn",
  "image": "assets/HybridQuantumClassicalNN.jpg",
  "tech": [
    "Python", "PyTorch", "PennyLane", "NumPy", "Matplotlib"
  ],
  "github": "https://github.com/liyuanmontreal/HybridQuantumClassicalNN",
  "description": {
    "en": "A hybrid quantum–classical neural network that combines differentiable quantum circuits with deep learning encoders for small-sample image classification and quantum feature exploration.",
    "zh": "一种混合量子–经典神经网络，将可微量子电路与深度学习编码器结合，用于小样本图像分类与量子特征探索。",
    "fr": "Un réseau neuronal hybride quantique-classique combinant des circuits quantiques différentiables avec des encodeurs d’apprentissage profond pour la classification d’images à faible échantillon et l’exploration de caractéristiques quantiques."
  }
},
{
  "name": "EcoSys",
  "slug": "ecosys",
  "image": "assets/ecosys.jpg",
  "tech": [
    "Python", "NumPy", "Pandas","Matplotlib", "Streamlit","Dynamic Programming"
  ],
  "github": "https://github.com/liyuanmontreal/ecosys",
  "description": {
    "en": "A dynamic programming-based ecosystem simulator. The goal is to balance economic returns with ecological conservation to optimize sustainable harvesting strategies.",
    "zh": "一个基于动态规划的生态系统模拟器。目标是平衡经济收益与生态保护，实现可持续收获策略优化。",
    "fr": "Un simulateur d’écosystème basé sur la programmation dynamique. L’objectif est d’équilibrer les rendements économiques avec la conservation écologique pour optimiser les stratégies de récolte durable."
  }
},
{
  "name": "Shadow",
  "slug": "shadow",
  "image": "assets/shadow.png",
  "tech": [
    "Python", "NumPy", "NegMAS","Matplotlib", "Streamlit","RL"
  ],
  "github": "https://github.com/liyuanmontreal/Shadow",
  "description": {
    "en": "Shadow is a multi-issue automated negotiation agent that learns concession and acceptance strategies to compete with ANAC-style AI opponents using game-theoretic reasoning and opponent modeling.",
    "zh": "Shadow 是一个多议题自动化谈判智能体，结合博弈论策略与对手建模，通过学习让步与接受机制来对战 ANAC 风格的智能体。",
    "fr": "Shadow est un agent de négociation automatisé multi-enjeux, intégrant raisonnement stratégique et modélisation de l’adversaire pour apprendre à concéder et accepter face à des agents IA de type ANAC."
  }
},
  {
  "name": "SpyNet",
  "slug": "spynet",
  "image": "assets/spynet.png",
  "tech": [
     "Python","PyTorch", "FastAPI","NumPy","Scikit-learn","Differential Privacy","Noise Injection","Quantization"
    ],
  "github": "https://github.com/liyuanmontreal/spynet",
  "description": {
    "en": "SpyNet is an interactive simulation of model stealing and defense in machine learning, demonstrating how an attacker can replicate a model through API queries and how defenses like noise, quantization, and differential privacy can protect it.",
    "zh": "SpyNet 是一个展示机器学习模型窃取与防御机制的交互式实验系统，模拟“间谍”如何通过 API 查询重建模型，以及“防御者”如何利用噪声、量化与差分隐私保护模型安全。",
    "fr": "SpyNet est une simulation interactive d’espionnage et de défense en apprentissage automatique, illustrant comment un attaquant peut reproduire un modèle via des requêtes API et comment des défenses comme le bruit, la quantification et la confidentialité différentielle peuvent le protéger."
  }
},
  {
  "name": "TrustNet",
  "slug": "trustnet",
  "image": "assets/trustnet.png",
  "tech": [
     "Python","NumPy","Matplotlib","Logistic Regression","Federated Learning"
    ],
  "github": "https://github.com/liyuanmontreal/trustnet",
  "description": {
    "en": "TrustNet: A socially-inspired federated learning framework that builds dynamic trust graphs to identify noisy or adversarial clients and enable more robust collaborative training.",
    "zh": "一种受社会心理机制启发的联邦学习框架，通过动态信任矩阵识别噪声与恶意节点，实现更稳健的协同训练。",
    "fr": "TrustNet : un cadre d’apprentissage fédéré inspiré de la psychologie sociale, utilisant une matrice de confiance dynamique pour détecter les clients bruyants ou malveillants et renforcer la collaboration."
  }
}


]