[
  {
  "name": "HybridQuantumClassicalNN",
  "slug": "qnn",
  "image": "assets/HybridQuantumClassicalNN.jpg",
  "tech": [
    "Python", "PyTorch", "PennyLane", "NumPy", "Matplotlib"
  ],
  "github": "https://github.com/liyuanmontreal/HybridQuantumClassicalNN",
  "description": {
    "en": "A hybrid quantum–classical neural network that combines differentiable quantum circuits with deep learning encoders for small-sample image classification and quantum feature exploration.",
    "zh": "一种混合量子–经典神经网络，将可微量子电路与深度学习编码器结合，用于小样本图像分类与量子特征探索。",
    "fr": "Un réseau neuronal hybride quantique-classique combinant des circuits quantiques différentiables avec des encodeurs d’apprentissage profond pour la classification d’images à faible échantillon et l’exploration de caractéristiques quantiques."
  }
},
{
  "name": "EcoSys",
  "slug": "ecosys",
  "image": "assets/ecosys.jpg",
  "tech": [
    "Python", "NumPy", "Pandas","Matplotlib", "Streamlit","Dynamic Programming"
  ],
  "github": "https://github.com/liyuanmontreal/ecosys",
  "description": {
    "en": "A dynamic programming-based ecosystem simulator. The goal is to balance economic returns with ecological conservation to optimize sustainable harvesting strategies.",
    "zh": "一个基于动态规划的生态系统模拟器。目标是平衡经济收益与生态保护，实现可持续收获策略优化。",
    "fr": "Un simulateur d’écosystème basé sur la programmation dynamique. L’objectif est d’équilibrer les rendements économiques avec la conservation écologique pour optimiser les stratégies de récolte durable."
  }
},
{
  "name": "Shadow",
  "slug": "shadow",
  "image": "assets/shadow.png",
  "tech": [
    "Python", "NumPy", "NegMAS","Matplotlib", "Streamlit","RL"
  ],
  "github": "https://github.com/liyuanmontreal/Shadow",
  "description": {
    "en": "Shadow is a multi-issue automated negotiation agent that learns concession and acceptance strategies to compete with ANAC-style AI opponents using game-theoretic reasoning and opponent modeling.",
    "zh": "Shadow 是一个多议题自动化谈判智能体，结合博弈论策略与对手建模，通过学习让步与接受机制来对战 ANAC 风格的智能体。",
    "fr": "Shadow est un agent de négociation automatisé multi-enjeux, intégrant raisonnement stratégique et modélisation de l’adversaire pour apprendre à concéder et accepter face à des agents IA de type ANAC."
  }
}
]