[
       {
    "name": "AI Strategy Lab",
    "slug": "ai-strategy-lab",
    "image": "assets/ai-strategy-lab.png",
    "tech": [
        "Python","NumPy","PettingZoo","Matplotlib","Gymnasiu","Reinforcement Learning","PPO"
        ],
    "github": "https://github.com/liyuanmontreal/ai-strategy-lab",
    "description": {
        "en": "AI Strategy Lab is a multi-agent strategy simulation platform powered by reinforcement learning, designed to study cooperation and competition among diverse unit types in virtual battlefields",
        "zh": "AI Strategy Lab 是一个基于强化学习与多智能体博弈的策略模拟平台，用于研究虚拟战场中不同阵营与职业之间的协作与对抗。",
        "fr": "AI Strategy Lab est une plateforme de simulation stratégique basée sur l'apprentissage par renforcement et la théorie des jeux multi-agents, utilisée pour étudier la coopération et la compétition entre différentes factions et classes sur un champ de bataille virtuel."
        }
    },
        {
  "name": "Condor",
  "slug": "condor",
  "image": "assets/condor.jpg",
  "tech": [
    "Python", "NumPy", "MPC", "off-line RL"
  ],
  "github": "https://github.com/liyuanmontreal/condor",
  "description": {
    "en": "This project applies Model Predictive Control (MPC) and Offline Reinforcement Learning (RL) to optimize California condor recovery strategies",
    "zh": "使用模型预测控制（MPC）与离线强化学习（Offline RL）优化加州秃鹰的生态恢复策略",
    "fr": "Ce projet applique le contrôle prédictif par modèle (MPC) et l’apprentissage par renforcement hors-ligne (RL) pour optimiser la stratégie de rétablissement du condor de Californie"
  }
},
     {
  "name": "World Model",
  "slug": "world-model",
  "image": "assets/world-model.png",
  "tech": [
    "Python", "NumPy", "Pandas","VAE","MDN-RNN","CMA-ES", "Matplotlib","Box2D + Pygame","Gymnasium (CarRacing-v2)"
  ],
  "github": "https://github.com/liyuanmontreal/world_model",
  "description": {
    "en": "This project reimplements the World Models framework using PyTorch, enabling intelligent agents to learn driving and planning within a 'dream world.'",
    "zh": "本项目使用PyTorch重新实现了 World Models 框架，使智能体能在“梦境世界”中学习驾驶与规划。",
    "fr": "Ce projet réimplémente le framework World Models en utilisant PyTorch, permettant aux agents intelligents d'apprendre à conduire et à planifier dans un « monde de rêve »."
  }
},

   {
  "name": "DetectiveRL",
  "slug": "detective-rl",
  "image": "assets/detective-rl.png",
  "tech": [
    "Python", "NumPy", "PyTorch", "Matplotlib","FFmpeg","Pillow"
  ],
  "github": "https://github.com/liyuanmontreal/DetectiveRL",
  "description": {
    "en": "A hierarchical reinforcement learning system based on reasoning allows an intelligent agent to act like a detective, gathering clues and updating beliefs to uncover the truth even with incomplete information.",
    "zh": "一个基于推理的层级强化学习系统，让智能体像侦探一样在不完全信息下通过收集线索与更新信念来锁定真相。",
    "fr": "Un système d'apprentissage par renforcement hiérarchique basé sur le raisonnement permet à un agent intelligent d'agir comme un détective, en rassemblant des indices et en mettant à jour ses croyances pour découvrir la vérité même avec des informations incomplètes."
  }
}，
]